> function cube (x) {
... return x * x;
... }
undefined
> cube(3)
9
> cube(5)
25

> function absolute (x) {
... if (x > 0) {
..... return (x)
..... } else {
..... return (x * -1)
..... }
... }
undefined
> absolute (-4)
4
